---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSettings.UseAnnotationScaleForSingleLineFittings
source: html/f786c693-a438-76a5-0adb-ed381c12130a.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.UseAnnotationScaleForSingleLineFittings Property

Indicates whether use annotation scale for single line fittings or not.

## Syntax (C#)
```csharp
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
```